######
# TAPS
######

# General
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "crowdin/crowdin"
tap "planetscale/tap"
tap "mike-engel/jwt-cli"

######
# APPS
######

brew "git-lfs"
brew "coreutils"
brew "gcc"
brew "bat"
brew "fd"
brew "fzf"
brew "pastel"
brew "noti"
brew "hyperfine"
brew "git-delta"
brew "ripgrep"
brew "tealdeer"
brew "wget"
brew "yadm"
brew "jql"
brew "jq"
brew "openjdk"
brew "pdftk-java"
brew "neovim"
brew "tree-sitter"
brew "luajit"
brew "imagemagick"
brew "ghostscript"
brew "starship"
brew "tokei"
brew "zoxide"
brew "bottom"
brew "asciinema"
brew "fish"
brew "neofetch"
brew "gitui"
brew "git-interactive-rebase-tool"
brew "zellij"
brew "rm-improved"
brew "diskus"
brew "dust"
brew "duf"
brew "jless"
brew "watchexec"
brew "procs"
brew "fclones"
brew "sd"
brew "gping"
brew "mysql-client"
brew "lnav"
brew "xh"
brew "onefetch"
brew "watchman"
brew "cocoapods"
brew "luarocks"
brew "openssl@3"

# Tap "mike-engel/jwt-cli"
brew "jwt-cli"

# Tap "crowdin/crowdin"
brew "crowdin@2"

# Tap "planetscale/tap"
brew "pscale"

#######
# CASKS
#######

cask "alacritty"
cask "kitty"
cask "visual-studio-code"
cask "sublime-merge"
cask "sublime-text"
cask "balenaetcher"
cask "keepingyouawake"
cask "postman"
cask "joplin"

cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

cask "itsycal"
cask "rectangle"
cask "dozer"
cask "bettertouchtool"
cask "raycast"
cask "kap"
cask "mpv"
cask "vial"

cask "spotify"
cask "vlc"
cask "slack"
cask "discord"
cask "signal"
cask "calibre"
cask "shottr"

cask "android-platform-tools"
cask "android-studio"
cask "zulu11"

# Tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# Tap "homebrew/cask-drivers"
cask "qmk-toolbox"
