######
# TAPS
######

# General
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "crowdin/crowdin"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "tgotwig/linux-dust"

######
# APPS
######

brew "coreutils"
brew "gcc"
brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "pastel"
brew "noti"
brew "hyperfine"
brew "git-delta"
brew "ripgrep"
brew "tealdeer"
brew "wget"
brew "yadm"
brew "yank"
brew "jq"
brew "openjdk"
brew "pdftk-java"
brew "neovim"
brew "ranger"
brew "starship"
brew "tokei"
brew "zoxide"
brew "bottom"
brew "asciinema"

# Tap "tgotwig/linux-dust"
brew "dust"

# Tap "crowdin/crowdin"
brew "crowdin@2"

#######
# CASKS
#######

cask "alacritty"
cask "kitty"
cask "visual-studio-code"
cask "sublime-merge"
cask "sublime-text"
cask "figma"
cask "docker"
cask "balenaetcher"
cask "joplin"
cask "keybase"
cask "keycastr"
cask "keepingyouawake"

cask "firefox"
cask "google-chrome"

cask "bitwarden"
cask "itsycal"
cask "rectangle"
cask "dozer"
cask "bettertouchtool"
cask "alfred"
cask "raycast"
cask "kap"
cask "mpv"
cask "vial"

cask "spotify"
cask "vlc"
cask "slack"
cask "discord"
cask "signal"

# Tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# Tap "homebrew/cask-drivers"
cask "qmk-toolbox"
